#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """✅ ** <u> أوامر المسؤول: </ u> **

 ** c ** تعني تشغيل القناة.

 / pause or / cpause - إيقاف تشغيل الموسيقى مؤقتًا.
 / استئناف أو / cresume- استئناف الموسيقى المتوقفة مؤقتًا.
 / كتم الصوت أو / سموت- كتم صوت الموسيقى قيد التشغيل.
 / unmute or / cunmute- قم بإعادة صوت الموسيقى الصامتة.
 / skip or / cskip- تخطي الموسيقى الجاري تشغيلها.
 / stop أو / cstop- أوقف تشغيل الموسيقى.
 / shuffle or / cshuffle- ترتيب قائمة التشغيل في قائمة الانتظار عشوائيًا.
 / تسعى أو / cseek - إلى الأمام ابحث عن الموسيقى لمدتك
 / Seeback or / cseekback - للخلف ابحث عن الموسيقى حسب مدتك
 / إعادة التشغيل - أعد تشغيل البوت للدردشة.


 ✅ <u> ** تخطي محدد: ** </u>
 / skip or / cskip [Number (example: 3)]
     - يتخطى الموسيقى إلى رقم محدد في قائمة الانتظار.  مثال: سيتخطى / skip 3 الموسيقى إلى الموسيقى في قائمة الانتظار الثالثة ويتجاهل الموسيقى 1 و 2 في قائمة الانتظار.

 ✅ <u> ** Loop Play: ** </u>
 / حلقة أو / cloop [تمكين / تعطيل] أو [أرقام بين 1-10]
     - عند التنشيط ، يقوم البوت بتكرار الموسيقى التي يتم تشغيلها حاليًا إلى 1-10 مرات في الدردشة الصوتية.  افتراضي إلى 10 مرات.

 ✅ <u> ** المستخدمون المصدقون: ** </u>
 يمكن لمستخدمي المصادقة استخدام أوامر المسؤول بدون حقوق المسؤول في الدردشة.

 / auth [Username] - أضف مستخدمًا إلى قائمة AUTH للمجموعة.
 / unauth [اسم المستخدم] - إزالة مستخدم من قائمة AUTH بالمجموعة.
 / المؤلفون - تحقق من قائمة المصادقة الخاصة بالمجموعة"""


HELP_2 = """✅ <u> ** تشغيل الأوامر: ** </u>

 الأوامر المتاحة = تشغيل ، vplay ، cplay

 أوامر ForcePlay = playforce ، vplayforce ، cplayforce

 ** c ** تعني تشغيل القناة.
 ** v ** تعني تشغيل الفيديو.
 ** القوة ** تعني اللعب بالقوة.

 / play أو / vplay أو / cplay - سيبدأ الروبوت في تشغيل استعلامك المحدد على الدردشة الصوتية أو بث الروابط المباشرة على الدردشات الصوتية.

 / playforce أو / vplayforce أو / cplayforce - ** Force Play ** يوقف مسار التشغيل الحالي على الدردشة الصوتية ويبدأ تشغيل المسار الذي تم البحث عنه على الفور دون إزعاج / مسح قائمة الانتظار.

 / channelplay [اسم مستخدم الدردشة أو معرف] أو [تعطيل] - قم بتوصيل القناة بمجموعة ودفق الموسيقى على الدردشة الصوتية للقناة من مجموعتك.


 ✅ ** <u> قوائم تشغيل خادم بوت: </ u> **
 / قائمة التشغيل - تحقق من قائمة التشغيل المحفوظة على الخوادم.
 / deleteplaylist - حذف أي موسيقى محفوظة في قائمة التشغيل الخاصة بك
 / تشغيل - ابدأ تشغيل قائمة التشغيل المحفوظة من الخوادم."""


HELP_3 = """✅ <u> ** أوامر البوت: ** </u>

 / stats - احصل على أفضل 10 مسارات للإحصائيات العالمية ، وأعلى 10 مستخدمين للروبوت ، وأعلى 10 محادثات على الروبوت ، وأفضل 10 تم لعبها في محادثة وما إلى ذلك.

 / sudolist - تحقق من مستخدمي Sudo لـ Yukki Music Bot

 / كلمات الأغاني [اسم الموسيقى] - للبحث في كلمات الأغاني الخاصة بالموسيقى على الويب.

 / song [اسم المسار] أو [رابط YT] - قم بتنزيل أي مقطع صوتي من youtube بتنسيقات mp3 أو mp4.

 / لاعب - احصل على لوحة لعب تفاعلية.

 ** c ** تعني تشغيل القناة.

 / queue أو / cqueue- تحقق من قائمة انتظار الموسيقى."""

HELP_4 = """✅ <u> ** أوامر إضافية: ** </u>
 / ابدأ - ابدأ Music Bot.
 / مساعدة - الحصول على قائمة مساعد الأوامر مع شرح مفصل للأوامر.
 / ping- Ping the Bot وتحقق من إحصائيات ذاكرة الوصول العشوائي ووحدة المعالجة المركزية وما إلى ذلك الخاصة بالبوت.

 ✅ <u> ** إعدادات المجموعة: ** </u>
 / الإعدادات - احصل على إعدادات المجموعة الكاملة باستخدام الأزرار المضمنة

 🔗 ** الخيارات في الإعدادات: **

 1️⃣ يمكنك ضبط ** جودة الصوت ** التي تريد بثها على الدردشة الصوتية.

 2️⃣ يمكنك ضبط ** جودة الفيديو ** التي تريد بثها على الدردشة الصوتية.

 3️⃣ ** المستخدمون المصدقون **: - يمكنك تغيير وضع أوامر المسؤول من هنا للجميع أو للمسؤولين فقط.  إذا كان الجميع ، أي شخص موجود في مجموعتك سيكون قادرًا على استخدام أوامر المسؤول (مثل / تخطي ، / إيقاف ، إلخ)

 4️⃣ ** Clean Mode: ** عند التمكين ، يحذف رسائل الروبوت بعد 5 دقائق من مجموعتك للتأكد من أن الدردشة الخاصة بك تظل نظيفة وجيدة.

 5️⃣ ** Command Clean **: عند التنشيط ، سيحذف Bot أوامره المنفذة (/ play ، / pause ، / shuffle ، / stop وما إلى ذلك) على الفور.

 6️⃣ ** إعدادات التشغيل: **

 / playmode - احصل على لوحة إعدادات تشغيل كاملة بأزرار حيث يمكنك ضبط إعدادات تشغيل مجموعتك.

 <u> الخيارات في وضع التشغيل: </ u>

 1️⃣ ** وضع البحث ** [مباشر أو مضمن] - يغير وضع البحث أثناء منحك / تشغيل وضع.

 2️⃣ ** أوامر المسؤول ** [الكل أو المسؤولون] - إذا كان كل شخص موجودًا في مجموعتك فسيكون قادرًا على استخدام أوامر المسؤول (مثل / تخطي ، / إيقاف ، إلخ)

 3️⃣ ** نوع التشغيل ** [الكل أو المسؤولون] - إذا كان المشرفون ، يمكن فقط للمسؤولين الموجودين في المجموعة تشغيل الموسيقى على الدردشة الصوتية."""

HELP_5 = """🔰 ** <u> إضافة وإزالة مستخدمي SUDO: </u> **
 / addudo [اسم المستخدم أو الرد على مستخدم]
 / delsudo [اسم المستخدم أو الرد على مستخدم]

 🛃 ** <u> HEROKU: </u> **
 / الاستخدام - Dyno Usage.

 🌐 ** <u> متغيرات التكوين: </ u> **
 / get_var - احصل على var config من Heroku أو .env.
 / del_var - احذف أي var على Heroku أو .env.
 / set_var [Var Name] [القيمة] - قم بتعيين Var أو تحديث Var على heroku أو .env.  منفصلة Var وقيمتها مع مسافة.

 🤖 ** <u> أوامر البوت: </ u> **
 / reboot - أعد تشغيل الروبوت الخاص بك.
 / تحديث - تحديث البوت.
 / speedtest - تحقق من سرعات الخادم
 / صيانة [تمكين / تعطيل]
 / المسجل [تمكين / تعطيل] - يقوم البوت بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
 / get_log [Number of Lines] - احصل على سجل للروبوت الخاص بك من heroku أو vps.  يعمل لكليهما.
 / autoend [تمكين | تعطيل] - تمكين إنهاء البث التلقائي بعد 3 دقائق إذا لم يكن هناك من يستمع.

 📈 ** <u> أوامر STATS: </u> **
 / activevoice - تحقق من الدردشات الصوتية النشطة على الروبوت.
 / activevideo - تحقق من مكالمات الفيديو النشطة على الروبوت.
 / stats - تحقق من إحصائيات الروبوتات

 ⚠️ ** <u> وظيفة الدردشة في القائمة السوداء: </ u> **
 / blacklistchat [CHAT_ID] - ضع أي دردشة في القائمة السوداء من استخدام Music Bot
 / whitelistchat [CHAT_ID] - أضف أي دردشة بالقائمة السوداء إلى القائمة البيضاء من استخدام Music Bot
 / blacklistedchat - تحقق من جميع الدردشات المدرجة في القائمة السوداء.

 👤 ** <u> وظيفة محظورة: </ u> **
 / block [اسم المستخدم أو الرد على مستخدم] - يمنع المستخدم من استخدام أوامر الروبوت.
 / إلغاء حظر [اسم المستخدم أو الرد على مستخدم] - إزالة مستخدم من قائمة بوت المحظورة.
 / blockusers - تحقق من قوائم المستخدمين المحظورة

 👤 ** <u> وظيفة GBAN: </u> **
 / gban [اسم المستخدم أو الرد على مستخدم] - Gban مستخدمًا من الدردشة التي يقدمها الروبوت وأوقفه عن استخدام برنامج الروبوت الخاص بك.
 / ungban [اسم المستخدم أو الرد على مستخدم] - أزل مستخدمًا من قائمة gbanned في Bot واسمح له باستخدام برنامج الروبوت الخاص بك
 / gbannedusers - تحقق من قوائم المستخدمين Gbanned

 🎥 ** <u> وظيفة مكالمات الفيديو: </ u> **
 / set_video_limit [عدد الدردشات] - قم بتعيين الحد الأقصى لعدد الدردشات المسموح بها لمكالمات الفيديو في كل مرة.  افتراضي إلى 3 محادثات.
 / videomode [تنزيل | m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم الروبوت بتنزيل مقاطع الفيديو بدلاً من تشغيلها في شكل M3u8.  افتراضيا إلى M3u8.  يمكنك استخدام وضع التنزيل عندما لا يتم تشغيل أي استعلام في وضع m3u8.

 ⚡️ ** <u> وظيفة البوت الخاص: </ u> **
 / يأذن [CHAT_ID] - اسمح بالمحادثة لاستخدام الروبوت الخاص بك.
 / unauthorize [CHAT_ID] - امنع الدردشة من استخدام الروبوت الخاص بك.
 / مخول - تحقق من جميع الدردشات المسموح بها في برنامج الروبوت الخاص بك.

 🌐 ** <u> وظيفة البث: </ u> **
 / بث [رسالة أو رد على رسالة] - بث أي رسالة إلى الدردشات التي يقدمها الروبوت.

 خيارات <u> للبث: </ u>
 ** - pin **: سيؤدي هذا إلى تثبيت رسالتك
 ** - pinloud **: سيؤدي هذا إلى تثبيت رسالتك بإشعار عالٍ
 ** - user **: سيؤدي هذا إلى بث رسالتك للمستخدمين الذين بدأوا برنامج الروبوت الخاص بك.
 ** - المساعد **: سيؤدي هذا إلى بث رسالتك من حساب المساعد الخاص بالبوت الخاص بك.
 ** - nobot **: هذا سيجبر الروبوت الخاص بك على عدم بث الرسالة

 ** مثال: ** "/ البث-المستخدم-المساعدة-اختبار مرحبًا`

"""
